app/controllers/api_controller.rb

SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "kyijxa9t9CA1eUjQGq44kwmu"], ["LIMIT", 1]]
---
    def authenticate_token
        authenticate_with_http_token { | token, options | User.find_by(auth_token: token)}