app/controllers/home_controller.rb

    def set_user
        @user = User.find_by!(auth_token: request.headers[:token])
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "dRAYUvU4Tvzm1PRY3p7wWStp"], ["LIMIT", 1]]