app/controllers/pet_users_controller.rb

    def show
        pet_user = PetUser.find_by!(pet_user.id)
---
SELECT "pet_users".* FROM "pet_users" WHERE "pet_users"."user_id" = $1  [["user_id", 2]]

    def create
        pet_user = PetUser.create!(pet_user_params)
---
INSERT INTO "pet_users" ("name", "species", "breed", "age", "gender", "size", "photo", "description", "contact", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def destroy
        pet_user = PetUser.find(params[:id])
        # pet_user.user = current_user
        pet_user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "pet_users".* FROM "pet_users" WHERE "pet_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pet_users" WHERE "pet_users"."id" = $1  [["id", 9]]