app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "email", "auth_token", "name", "zipcode", "has_cats", "has_dogs", "has_child", "has_yard", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def profile
    user = User.find_by!(auth_token: request.headers[:token])
    user_pets = PetUser.where(user_id: user.id)
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "Z4G8bzJuhEMnzNfNdW6RQR6y"], ["LIMIT", 1]]
SELECT "pet_users".* FROM "pet_users" WHERE "pet_users"."user_id" = $1  [["user_id", 2]]

  def update
    user = User.find_by!(auth_token: request.headers[:token])
    user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "r183aSYePGPFa7o5TGVKWM1H"], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "name" = $2, "zipcode" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["email", ""], ["name", ""], ["zipcode", nil], ["updated_at", "2020-09-23 21:57:37.551098"], ["id", 2]]