app/models/user.rb

UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", nil], ["updated_at", "2020-09-20 19:42:01.333952"], ["id", 5]]
---
    def invalidate_token
        self.update(auth_token: nil)